trade_exp/src/Documents/ОперацияПоПлатежнойКарте/ОперацияПоПлатежнойКарте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОперацияПоПлатежнойКарте</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КодАвторизации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭквайринговыйТерминал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерПлатежнойКарты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>22</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="519f7081-fbb2-4e09-b49f-933cd57fe47b">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2bd26061-21f8-477c-a020-950c3ff9e7ec">
    <name>ДеньгиВнесеныCотрудником</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9a4faab9-0d8e-4f9d-92a2-d5dad0978e3f">
    <name>СотрудникВнесшийДеньги</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="32212b4a-8193-4934-ba95-d3ed10bd7e8b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ecc4eb3a-88e5-486f-a05e-f6c046cadcf8">
    <name>ДоговорЭквайринга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="16dfe378-fa95-4582-8aa7-ded2305d30d3">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8034211b-1cf9-4a82-967b-6602bfaae416">
    <name>СуммаКомиссии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a1e13273-a58d-4cf1-9c0e-0b9661124521">
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fef872a-3dcd-4c7f-a523-c3fda7f49b31">
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6e9692b3-ee83-4533-81cd-7e8c35d1092e">
    <name>НомерЧекаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6f39ab37-410a-4b78-a50b-d5c2129ecc65">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dc1fbe56-8f5d-46b8-baa2-14741212b2bf">
      <name>КурсЧислительВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="855c6534-ffa9-4192-93d5-baabbf4e3f5d">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ОперацияПоПлатежнойКарте/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьТерминалССайтаПоУмолчанию() Экспорт
	Возврат Справочники.ЭквайринговыеТерминалы.НайтиПоНаименованию("Сайт, СБП Открытие (Альтерра)");
КонецФункции

Функция ПолучитьЭквайринговыйТерминал() Экспорт
	
	РабочееМестоКассира = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	
	Если ЗначениеЗаполнено(РабочееМестоКассира) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиРМКЭквайринговыеТерминалы.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал
		|ИЗ
		|	Справочник.НастройкиРМК.ЭквайринговыеТерминалы КАК НастройкиРМКЭквайринговыеТерминалы
		|ГДЕ
		|	НастройкиРМКЭквайринговыеТерминалы.Ссылка.РабочееМесто = &РабочееМесто
		|	И НастройкиРМКЭквайринговыеТерминалы.НомерСтроки = 1";
		
		Запрос.УстановитьПараметр("РабочееМесто", РабочееМестоКассира);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ЭквайринговыйТерминал) Тогда
			Возврат Выборка.ЭквайринговыйТерминал;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.ЭквайринговыеТерминалы.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьЭквайринговуюОперацию(Заказ, ЭквайринговыйТерминал = Неопределено) Экспорт
	ПроверкаНеПроведенного = Истина; //обработка строк - ЗаказКлиента.ФормаДокумента.Док_ПослеЗаписиПослеНаСервере
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
		|ГДЕ
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ОснованиеПлатежа = &Заказ
		|	И НЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ПометкаУдаления
		|	И (НЕ &ПроверкаНеПроведенного
		|			ИЛИ НЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен)
		|{ГДЕ
		|	(ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал = &ЭквайринговыйТерминал
		|			И НЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен)}";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Если Не ЭквайринговыйТерминал = Неопределено Тогда
		Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
		ПроверкаНеПроведенного = Ложь;
	КонецЕсли;
	Запрос.УстановитьПараметр("ПроверкаНеПроведенного", ПроверкаНеПроведенного);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ПроверкаНеПроведенного Тогда
		Возврат Выборка; //Возвращаем всю выборку для обхода и корректировки строк
	Иначе
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

//Функция ПолучитьТерминалСБППоУмолчанию() Экспорт
//	Возврат Справочники.ЭквайринговыеТерминалы.НайтиПоНаименованию("СБП Газпромбанк");
//КонецФункции

#КонецЕсли
